/*
 * main.c
 */
#include "DSP280x_Device.h"
//------------------------------------------------------------------------------

    void (*Alpha_State_Ptr)(void);                                              // Підпрограмма опитування кнопок
    volatile struct SYSTEM sys;
    Uint16 VTimer0[4];                                                          // Таймер кнопки Старт/Стоп
    Uint16 VTimer1[4];                                                          // Таймер кнопки Вбір
//    Uint16 VTimer2[4];                                                          //

    void (*RcvTaskPointer)(void);

//------------------------------------------------------------------------------
//                          Тест 100В
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//                          Світлодіод
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//                          Кнопки
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------

int main(void) {

	DeviceInit();
#ifdef FLASH 																	// При використанні Flash
	MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart); 			 // копірування основних функцій в флеш


	InitFlash();																// Ініціалізація банку памяті
#endif
    CpuTimer0Regs.PRD.all =  Sec0_1;                                            // Період таймера для задачі A
    CpuTimer1Regs.PRD.all =  Sec0_1;                                            // Період таймера для задачі B
//    CpuTimer2Regs.PRD.all =  Sec0_1;                                          // Період таймера для задачі C

    VTimer0[0] = 0;
    VTimer1[0] = 0;
//    VTimer2[0] = 0;


    InitScilHost(Ch_A, Rate_921_kB_s);
    Alpha_State_Ptr = &A0;                                                      //                                                         //
//----------------------------Відправляємі дані з ПК----------------------------
//-------------------------Вбудовані відправляємі дані--------------------------


for (;;){ /*<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>*/

   //===========================================================
    (*Alpha_State_Ptr)();   // (A0,B0,...)
    //===========================================================
}/*<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>  for END  <><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>*/
}/*<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>  mine END <><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>*/

void A0(void){
    if(CpuTimer0Regs.TCR.bit.TIF == 1){
        CpuTimer0Regs.TCR.bit.TIF = 1;
/**********Підпрограма опитування USB *****************************************/
        (*RcvTaskPointer)();
        sys.uart.SerialCommsTime++;

/*****************************************************************************/
        VTimer0[0]++;}           // Таймер генератора  0
    Alpha_State_Ptr = &B0;}      //

void B0(void){
    if(CpuTimer1Regs.TCR.bit.TIF == 1){
        CpuTimer1Regs.TCR.bit.TIF = 1;

        VTimer1[0]++;}           // Таймер генератора  1
    Alpha_State_Ptr = &A0;}      //











